Revit 2027 API
ContourSettingItemType Enumeration
 The type of a ContourSettingItem
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ContourSettingItemType
Public Enumeration ContourSettingItemType
public enum class ContourSettingItemType
type ContourSettingItemType
Members
Member name | Value | Description
BoundedRange | 2 |  The item contains contour lines in a bounded range.
Single | 0 |  The item only contains a single contour line.
UnboundedRange | 1 |  The item contains contour lines in an unbounded range.
See Also
Reference
Autodesk.Revit.DB Namespace